app/Controllers/AchatDetailController.php

SELECT *
FROM `Produit`
---
    public function index()
    {
        $produitModel = new ProduitModel();
        $produits = $produitModel->findAll();