app/Controllers/AchatController.php

    public function index(){
        $caissesModel = new CaisseModel();
        $caisses = $caissesModel->findAll();
---
SELECT *
FROM `Caisse`

    public function create()
    {
        $model = new AchatModel();
        $data = $this->request->getPost();
        $session = session();

        $model->insert([
            'idUser' => $data['idUser'],
            // 'idCaisse' => $data['idCaisse'],
            'idCaisse' => $data['idCaisse'] ?? null, // ou gérer autrement
            'date' => date('Y-m-d H:i:s') // ou laisser SQLite gérer
        ]);
---
INSERT INTO `Achat` (`idUser`, `idCaisse`, `date`) VALUES ('1', '1', '2026-06-17 09:17:00')