app/Controllers/CaisseAppController.php

SELECT *
FROM `User`
WHERE `username` = 'jean'
 LIMIT 1
---
    public function login()
    {
        $body = $this->request->getJSON(true);
        $username = trim($body['username'] ?? '');
        $mdp      = $body['mdp'] ?? '';

        if (!$username || !$mdp) {
            return $this->response->setJSON(['success' => false, 'message' => 'Champs manquants'])->setStatusCode(400);
        }

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();